Revit 2027 API
Transform2D.AlmostEqual Method
 Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AlmostEqual(
	Transform2D right
)
Public Function AlmostEqual (
	right As Transform2D
) As Boolean
public:
bool AlmostEqual(
	Transform2D^ right
)
member AlmostEqual :
        right : Transform2D -> bool
Parameters
right Transform2D
 The transformation to compare with this transformation.
Return Value
Boolean
 True if the two transformations are equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The tolerance is applied memberwise for comparison.
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace